Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江逸暗暗心惊，这种宝物他见过一次，江恨水在两年前家族大比显露过。他也看过一些书，知道这个世界的武器宝物从低到高分为利器，宝器，灵器，圣器四阶。也只有宝器级别以上神兵才能灌注元力，而一旦宝器灌注了元力将会削铁如泥，锋利无比！他这一拳要是敢砸下，整个拳头绝对会变成碎肉……
en_us: Jiang Yi was in silent shock. He had only seen such a treasure once before in his life, in the hands of Jiang Henshui at the family clan's Grand Tournament two years ago; in addition, he had read several books on the subject, so he knew that all weapons in this world were graded into four ranks, in order from low to high: Keen Artifact, Treasured Artifact, Numinous Artifact, and Sacred Artifact. Only weapons that belonged to the rank of Treasured Artifact and above could be infused with essence force. Once this was done, the treasured artifact would become so powerful and sharp-edged that it could slice through metal like it was mud! If Jiang Yi dared to land his fist, it would surely become minced meat...

source: 江逸暗暗惊叹，看来这练功房内有某种奇异的阵法，能禁锢里面所有武者的元力。
en_us: Jiang Yi silently sighed to himself in surprise. Looks like there was some sort of mysterious magical spell at work in that technique practicing room that could prohibit the use of essence forces by all martial artists inside.

source: 江逸暗暗惊疑，那少爷却一言不发进了练功房，江逸只好跟了进去。
en_us: Jiang Yi was in silent bewilderment. The young master in the meantime had gone into the Technique Practising Room without another word. Jiang Yi had no choice but to follow him in.

source: 江逸暗暗想到，目光偷偷的朝姬听雨看去，想看看她有什么反应？
en_us: Jiang Yi silently wondered, if he stole a glance in the direction of Ji Tingyu, what reaction would she give him?

source: 江逸暗暗感慨一声，不过拳影多少对于他完全无效，因为他能清楚的看到对方的真实拳身，就算对方幻出一百个拳影也是一样的。
en_us: Jiang Yi quietly sighed to himself sorrowfully. However, the fist silhouettes were completely ineffective against him, as he could see clearly his opponent's real fists - it would be the same result, even if his opponent produced the images of one hundred fist silhouettes.

source: 江逸暗暗感慨一声，脸上并不慌乱，他的视力极其恐怖，江如龙的攻击轨迹他预算得清清楚楚，身子继续朝前方冲去，不过半个身子后仰轻松躲过江如龙的鞭腿，一双手运转缠丝手闪电般的缠住江如龙的另外一条腿，猛然用力抡了起来。
en_us: Jiang Yi sighed in silent but didn't panic. He had terrific visions and could clearly predict Jiang Rulong's attack trajectories. He continued to dash towards the front but took half a step back to easily dodge Jiang Rulong's leg whip. He then used the Silk Hands to wrap around Jiang Rulong's other leg and began to whirl vigorously.

source: 江逸暗暗打定主意，无所事事取来扫帚打扫起来，刚刚把整个炼丹房内外都打扫完毕，就看到一个高大身影快步冲进来，一头灰白色的头发如杂草般散乱，一双鼓起来的牛眼更是满是血丝，他一边走还一边神神叨叨的喃喃道：“没道理，没道理啊，这地阶丹药里面的那种莫名成分到底是什么？到底是什么？难道是白芷粉？或者是姜黄……”
en_us: After silently making up his mind on the matter, with nothing better to do he picked up a broom and started sweeping the floor. Just as he completed cleaning up the entire alchemy lab from inside and out, he saw a giant figure rush in with quick steps. The figure had a head of grey-white hair that was messy like weeds and a pair of bulging, bloodshot eyes. "This doesn't make sense," the figure muttered. "It doesn't make sense at all! What is the mysterious unknown ingredient that is in this earth-level elixir? What on earth could it be? Perhaps it is angelica dahurica powder? Or could it be tumeric..."

source: 江逸暗暗抱怨起来，转念想到，好像自己身上还有一枚最低级的元力丹？他不是有黑色元力吗？他完全可以增幅这元力丹的药效啊？那样不就可以快速修炼吗？
en_us: Just then he remembered that it seemed like there was still lowest-grade essence force pill. And did he not have black essence force? Surely, he could increase the medicinal efficacy of the essence force pill. In that way, could he not speedily practice and refine?

source: 江逸暗暗沉吟，一名黑袍管事模样老头走了过来，扫了他一眼，递给他一块青铜打制的狼头面具，漠然说道：“带上面具，你的代号是苍狼，等下我会叫你上场。你是铜牌陪练，陪练到天黑算一天，一两银子，中途退出，没钱。”
en_us: As Jiang Yi was pondering on his situation, an old man wearing a black robe and giving off the appearance of a manager walked over to him. Giving him a glance, he passed to Jiang Yi a wolf-head mask made of bronze before coldly saying, "Put on the mask. Your code name is 'Lone Wolf'. Later I will call on you to take the field. "You are a bronze-token-grade sparring partner. The workday of a sparring partner is counted if he works from dawn to dusk, while the daily rate is a tael of silver. If you quit in the middle of the day, you get no money."

source: 江逸暗暗点头，他外面买的黑袍也是便宜货，这管事没有让人把他赶出去，还如此礼貌，天羽城第一大商号果然不凡。
en_us: Jiang Yi nodded silently. The black robes he bought outside was considered cheap-quality goods, yet not only did this housekeeper not chase him out, he had even remained ever-so courteous. The number one merchant-house of Skyplume City was indeed special.

source: 江逸暗暗狂喜，压在心头的一块大石头，终于放下来一半。本来非常不想在这柳长老手下干活，此刻倒是一百个乐意了。
en_us: Jiang Yi was secretly in ecstasy, finally being able to put down some of the stress applying pressure on his heart like a rock. Initially, he was very unwilling to work under Elder Liu; at this moment he was more than happy to do so.

source: 江逸暗暗着急，时间已经不早了，他如果耽误药田清点，怕是又要被荣管事责骂了。问题是伤势没好，他根本不敢上药山，怕被江如虎等人给堵了。
en_us: Jiang Yi was inwardly anxious. It was no longer early—should he delay taking stock in the herb fields, he might get scolded by Chief Rong again. The problem was that, with his unhealed wounds, he did not dare to go to the fields at all, for he was scared of being harassed by Jiang Ruhu and his gang.

source: 江逸暗道不妙，他黑色元力全部用完，恰好眼中也黑光一闪逐渐的模糊起来，显然眼睛附近的黑色元力已消耗干净了。没有黑色元力，他就是实实在在的铸鼎境一重武者，哪是这铸鼎境二重护卫的对手？
en_us: Jiang Yi sensed that he was in trouble. He had already used up all his black essence force, while coincidentally the dark spark in his eye was also gradually becoming increasingly blurry. It was evident that the black essence force near his eyes had been completely consumed. Without black essence force, he was in reality just a martial artist at the first stage of the Cast Tripod Realm. How could he be any match for this guard at the second stage of the Cast Tripod Realm?

source: 江逸暗道不妙，却是不敢冒然动手抢夺令牌，因为那护卫被这马家公子一喝立即收回了令牌，他出手的话没把握夺下令牌，只能冷着脸朝马家公子望去。
en_us: Jiang Yi could sense that the situation was heading downhill, but he dared not risk taking the command token by force. With the guard withdrawing the command token to himself the moment he heard the Ma Family young master's shout, there was no guarantee that Jiang Yi could succeed in forcibly taking it. All he could do was looking coldly at the Ma Family young master.

source: 江逸暗道不妙，此刻武殿内到底有多少公子小姐进来闭关修炼了？该有多么缺陪练啊？竟如此饥不择食，他一个铸鼎境一重的陪练，对方还生怕他不干了。
en_us: Jiang Yi thought to himself that something was amiss. How many young masters and young mistresses were there in the Martial Arts Hall? Should there be that bad of a shortage of sparring partners? It was unbelievable that the adage "beggars cannot be choosers" could apply to them now, and that even Jiang Yi with his power level at the first stage of the Cast Tripod Realm could apply to be a sparring partner; better yet, the other people involved were even scared that he would decide to quit.

source: 江逸有些可怜的望着这位被打成猪头的仁兄，这人只是铸鼎境二重，那翊小姐实力明显最少都是铸鼎境四重，就算双方元力封印了，也完全不是一个级别的。
en_us: Jiang Yi looked sympathetically at his dear comrade-in-arms who had just been beaten to a pulp. This man was only at the second stage of the Cast Tripod Realm, whereas that Young Mistress Yi evidently had a power level minimally at the fourth stage of the Cast Tripod Realm. Even if the essence force of the two sparring parties were sealed, the two were completely not a match for each other.

source: 江逸有些无语，江家姓柳的长老可就只有一个……
en_us: Jiang Yi was somewhat speechless—there was only one elder with the surname Liu in the Jiang Clan after all...

source: 江逸本想把江如虎等人偷药更殴打他的事情说出来，但才开口就忍住了。因为他刚想起那江如虎的父亲好像就是家族的大管事，更是眼前这位荣管事的顶头上司。这事要是爆出来，只怕这荣管事不仅不会帮他，反而会指黑为白，重重责罚他吧？
en_us: Jiang Yi was about to relate the incident of Jiang Ruhu and his cronies stealing medicine and beating him up, but he stopped himself just as he opened his mouth to speak. He had remembered that not only was Jiang Ruhu’s father the family’s chief supervisor, he was also Chief Rong’s head honcho. Should this incident be revealed by Jiang Yi… not only would Chief Rong not help him at all, Chief Rong may even invert right and wrong and punish him instead!

source: 江逸欣喜若狂，取出丹炉内三枚黑色丹药，闻着里面的淡淡清香，他激动的身子都颤抖不停，看着手心的三枚丹药就像看着三个脱光衣服的美女般诱人。
en_us: Jiang Yi was wild with joy. Retrieving the three black elixir pills from within the cauldron, and smelling the faint fragrant odor emitting from the cauldron, he was so excited that his body was uncontrollably shaking. He stared intently at the three pills in his palm, the pills being alluring like three naked beautiful ladies.

source: 江逸正低头打扫，猛然抬头一看，被这人吓了一跳，定睛一看才连忙拱手行礼：“柳长老好。”
en_us: Jiang Yi was sweeping the floor with his head lowered. When he suddenly raised his head to take a look, he got a shock from the appearance of this person. Getting a good look, he hastily cupped his heads, bowed, and greeted, "Greetings, Elder Liu."

source: 江逸正瞅得有趣，哪知下一瞬间，异变再生！
en_us: Just as Jiang Yi’s interest reached a peak, the words experienced a complete transformation!

source: 江逸此时的心跳有点加快，一种说不清道不明的兴奋感洋溢在心头。无意中捡到一种增强实力的办法，即便依旧没有改变他修炼元力缓慢的体质，但至少能让他将江豹给轻松击败，让他胸中这股压抑多年的闷气终于痛快的发泄了出来。
en_us: Jiang Yi's heartbeat quickened as an unexplainable excitement washed over him. Having unwittingly picked up a method that could increase his strength, he could, at least, defeat Jiang Bao easily. This was despite not being able to change his body, which accumulated essence force at a snail’s pace. He would finally be released from his suffering.

source: 江逸死里逃生，连忙擦了擦冷汗，紧张地注视着柳长老的一举一动。
en_us: Jiang Yi had just escaped from death. Hurriedly wiping off his cold sweat, he nervously observed Elder Liu's every little move.

source: 江逸每天大部分时间都在闭关修炼，每天只睡两三个时辰，每每想到江小奴一个人孤苦伶仃的在家，也不知道会不会出事，他的心就急如火焚，恨不得立即修炼到铸鼎境四重，好回家看看。
en_us: Jiang Yi was in seclusion most of the time, sleeping only four to six hours every day. Whenever he thought of Jiang Xiaonu alone and hapless at home, with no way of knowing if she was all right, his heart became aflame with anxiety and worry, and he would fervently wish that he could the fourth stage of the Cast Tripod Realm right here, right now, so he could go back home.

source: 江逸毫不客气的坐在小胖子的床上，目光灼灼的盯着他，开口道：“钱万贯，你能帮我做件事不？这事要是做成了，我江逸欠你一个人情！”
en_us: Jiang Yi made himself at home and sat on Fatty's bed, before staring at him with a twinkle in his eyes, "Qian Wanguan, can you help me on this one? I, Jiang Yi, owe you one if we succeed!"

source: 江逸气炸了，这可不单单是一块令牌，而是小奴的命啊！他咬牙低头下去，不断在内心默念要冷静要冷静，今日不能出手，否则事情闹大了对小奴没好处。
en_us: Jiang Yi was almost bursting at the seams with rage: this was not just some command token, Xiaonu's life depended on it! With his teeth clenched and head bowed, he silently told himself over and over to remain calm. He would not lash out today - to do otherwise would do Xiaonu no good.

source: 江逸沉吟了一阵，便不再多想，开始快速的提炼黑色元力，破解封印。他现在每天能破解十枚封印符文左右，其余时间都用来修炼，修炼速度也在逐步提升，此刻都达到了原先的七八倍左右了，尽管这速度相对而言依旧很慢，但江逸已经非常满足了。
en_us: Jiang Yi muttered to himself for a moment, before deciding not to overthink and instead starting to quickly refine more black essence force to break his seal. At the present moment, he could remove approxmiately ten of the runic patterns on the seal daily. The remaining time was spent on power cultivation. His cultivation speed was also gradually increasing, presently reaching up to seven or eight times of his original speed. Even though comparatively speaking this speed was still very slow, Jiang Yi was already very satisfied with such results.

source: 江逸沉吟起来：“看来还是黑色元力太少的缘故，我昨天尝试修炼那无名口诀半个时辰后，就因为效果不佳终止了修炼，所以只修炼出来一丝黑色元力储存在左臂里。在刚才使出摔碑手的时候，这丝黑色元力大概就已经消耗完了吧，所以后面蛇鞭腿的威力才又恢复了正常。”
en_us: "From the looks of it,” Jiang Yi muttered pensively, ”it has to be because there's insufficient black essence force. I only tried practicing the nameless formula for one hour yesterday and stopped when the results were not ideal.” “The sliver of black essence force I cultivated only accumulated in my left arm. The power of the Wrestling Hand exceeded the norm as it drained the sliver of black essence force. The force behind the Snake Whip Leg was average as it only used my regular essence force.”

source: 江逸沉思一阵，将丹田内的一缕黑色元力调集出来，运转到眼角的经脉内，却发现和原先并没有不同，视力虽然一样变得恐怖但却并没有进一步的增幅。
en_us: Jiang Yi contemplated deeply for a moment, before summoning a wisp of black essence force out from within his dantian and circulating it to the meridians at the corner of his eye. However, he discovered that there was no difference from before - while his sight had changed an obscene amount as before, yet this change was not greater than before.

source: 江逸沉默的走进去，等门一关那翊飞儿立即脸色一沉，双腿一点，双拳化作漫天的拳影就朝江逸砸来，力道十足。
en_us: Jiang Yi wordlessly went in. The moment the doors were shut, Yi Fei-er's expression darkened; her legs pushed off the ground, fists transforming into fist silhouettes the filled the air, hurtling towards Jinag Yi with sheer power.

source: 江逸没有去武殿，而是一路狂奔回到了江家，走进江家大院后他绷紧的心才放松了下来。
en_us: Jiang Yi did not head to the Martial Arts Hall; rather, he darted all the way home. It was only until he stepped into the Jiang Clan backyard that his frayed nerves relaxed.

source: 江逸没有去追，反而有些诧异的望着自己的双腿，他刚才那几腿几乎是全力施展，却只能将江豹踢飞一丈远？力量明显比刚才少了很多，很明显又恢复了正常水平……
en_us: Jiang Yi did not chase after him. His attention was focused on his legs. Earlier, he had exerted all his strength in the kicks he threw, but they only managed to send Jiang Bao flying ten feet back. Its power was definitely lacking compared to his earlier strikes. It was on par with his original strength.

source: 江逸没有理会马飞，勒住马飞的那只手快速一闪，化作掌刀在马飞一只手掌一切，马飞手掌吃痛手中握住的一块令牌被江逸抓住。
en_us: Jiang Yi ignored Ma Fei; the hand that was on Ma Fei's neck moved rapidly and cut down on Ma Fei's palm in a chopping movement, causing him to jerk in pain and release the command token in his hand.

source: 江逸没有说话，继续沉默，在江如虎不耐烦准备一挥手让人攻击时，他却突然开口道：“好！我爬，只希望……虎哥你说话算数。”
en_us: Jiang Yi did not utter a word, instead remaining completely silent. It was only when Jiang Ruhu, in his impatience, was ready to wave his hand and allow his men to launch their attack, that Jiang Yi suddenly opened his mouth and responded, "Very well! I'll crawl. I just hope that... Brother Hu, you will keep your promise."

source: 江逸没有那么蠢，本想朝江如龙一脚踩下的腿立即收了回来，满脸正色的望着锦袍众人拱手行礼道。
en_us: Jiang Yi wasn't stupid, the leg that was originally about to trample on Jiang Rulong, was withdrawn immediately. He looked at the robed individuals with an unflinching expression while bowing with respect.

source: 江逸没说话，眸子内却要喷火了，按江小奴说的结合他看到的场景，他可以百分百确定，今天这事是风月楼那个管事搞的鬼。
en_us: Jiang Yi said nothing, but his pupils appeared to be spouting fire. Based on what Xiaonu said, combined with the context he had witnessed, he could confirm with one hundred percent accuracy that the events that happened today was caused by that housekeeper from Fengyue Brothel.

source: 江逸浑身一颤，立即头摇得拨浪鼓般，果断拒绝道：“不行啊，柳长老，我不懂炼丹，我什么也不会，而且……我现在还在药田内做事，我要是在您这帮忙，荣管事那边没办法交代啊。”
en_us: Jiang Yi shuddered and immediately shook his head like a rattle drum, resolutely rejecting the offer. "No way, Elder Liu. I don't know how to refine elixirs—for the matter I don't know anything. On top of that... I'm right now still working in the herb plantations. If I were to work for you here, I don't know how I’d account to Chief Rong."

source: 江逸淡淡一笑，淡淡瞥了江如虎一眼，看着他那张肥嘟嘟的胖脸，内心一阵厌恶，他飒然一笑道：“柳长老前两日交代了，任何人来取丹药都不给，江如虎你想拿丹药，自己取吧，我可不敢帮你们拿。”
en_us: Jiang Yi smiled faintly and slightly shot Jiang Ruhu a glance. Seeing his round chubby cheeks, he left a sense of disgust and hatred in his heart. Yet he smiled sweetly and replied, "Elder Liu gave the instruction two days ago that no one is allowed to retrieve any elixirs. Jiang Ruhu, if you want to take elixirs, go ahead and take them yourself. I do not dare to help you two take any."

source: 江逸淡淡一笑，轻描淡写的回了一句：“十日之后，午时三刻，我会出江家西门，那附近有一条小巷，我在那等着你，希望你别迟到了。”
en_us: Jiang Yi laughed faintly. "In ten days' time, at the forty-fifth minute after noon, I will leave the western door of the Jiang Residence. There is a small alleyway near that door. I'll be there waiting for you, so I hope you won't be late."

source: 江逸满眸愕然，他陪人对练还能让对方武技快速大成？这个世界有如此邪门的事情？不过……好像这翊小姐最近武技进步的速度的确有些夸张吧？难道真是因为他？
en_us: Jiang Yi's eyes were filled with surprise. He could help someone's martial art technique to achieve phenomenal success through sparring? Could there be such a bizarre thing in this world? Although... Young Mistress Yi's progress did seem unnaturally fast recently, was it really because of him?

source: 江逸满脸尴尬，进也不是，退也不是，愣在原地。
en_us: Jiang Yi's face showed his awkwardness—standing his ground on the original spot where he was at, neither entering nor leaving.

source: 江逸满脸的震愕，原本他还想着等以后黑色元力多了，尝试运转黑色元力全力攻击，看看威力是否巨大？如果确定威力增幅很大，那么就算这黑色元力修炼的速度比原本蓝色元力还要慢上很多，他也要慢慢改练这无名功法了。
en_us: Jiang Yi's face was full of shock. Originally he had thought that when he had increased his black essence force in the future, he could try to work the essence force in a full-powered attack and see if the power was enormous. If he could confirm that his power had increased greatly, he wanted to slowly change and practice this nameless cultivation technique instead, even if the speed of cultivating black essence force was much slower than that of the original blue essence force.

source: 江逸点了点头，如果不是因为这一点，他怎么舍得把两枚金叶子送给这荣管事？江家族规森严，未经家族允许擅自离开本族的按叛族罪处理，如果江逸死在外面倒是好说，如果定罪了被江家子弟看到，那是有权当场格杀的。
en_us: Jiang Yi nodded: he would not have willingly given Chief Rong the two pieces of gold leaf were he not intending to prevent exactly that from happening. The Jiang Clan had strict family laws: any member who left the family clan without permission would be pronounced as a renegade. Should such a fate befall on Jiang Yi, the easier alternative would be if he were already dead, as compared to being found by any of the Jiang Clan descendants, who would have unopposed authority to kill on sight.

source: 江逸点了点头，快速道来：“第一，我不能一整天在武殿，当然如果有时间我会尽量来武殿，第二我需要……预支薪水。”
en_us: Jiang Yi nodded his head and speedily replied, "Firstly, I cannot be in the Martial Arts Hall for the entire day. Of course, if I have the time, I will try my best to be in the Martial Arts Hall. Secondly, I need... an advance on my pay."

source: 江逸点了点头，既来之则安之，平时没机会进这种富贵子弟玩的高端地方，现在来见见世面也是好的。
en_us: Jiang Yi nodded his head. Since he was already there, he should make the best of it. After all, he normally did not have the opportunity to enter such a high-end place, where children of rich and powerful families came to play. It was also good to be able to see the world.

source: 江逸点了点头，转身离开准备回家疗伤，不料那荣管事突然开口道：“对了，江逸，你既然去炼丹房做事了，我给你的令牌交上来吧，以后也不要没事上西山了。”
en_us: Jiang Yi nodded his head and turned around to return home, ready to heal his wounds. Unexpectedly, Chief Rong suddenly opened his mouth and said, "Right, Jiang Yi, since you're headed to work at the alchemy lab, return me the command token I gave you. Don't head up to the Western Hills if you have no business there either."

source: 江逸狐疑的扫了钱万贯一眼，问道：“我的身份？你知道我是什么身份？”
en_us: Filled with doubt, Jiang Yi scanned Qian Wanguan, and asked, “My identity？You know what's my identity？”

source: 江逸狐疑的眨了眨眼，问道：“没问题了，只是我们不需要缔结契约之类的吗？”
en_us: Still filled with doubt, Jiang Yi blinked his eyes and asked, "I don't have any other questions, just that... Don't we need to sign a contract of mutual agreement or something like that?"

source: 江逸玩得不亦乐乎，只要融合了一丝黑色元力，那么操作江水诀元力配合武技击出的威力，就会比原先增大两到三倍。
en_us: Jiang Yi had a great time. All he needed was to fuse the two essence force, and his strength would increase threefold.

source: 江逸琢磨了一下，果断放弃疗伤，开始转练无名功法，提炼黑色元力。
en_us: Jiang Yi pondered for a while and gave up on healing his injuries. He started practicing the nameless cultivation technique instead, to extract some black essence force.

source: 江逸生生的承受那一个铸鼎境三重武者一拳，只为更快速的接近江如虎，只为此刻喷他一脸血。他这是一场豪赌，毕竟铸鼎境三重的武者力量已经达到三马之力，他那一拳不是关键时提速一分，抵消了一些力量，此刻江逸后背骨头都断了。还有他人在半空，假如江如虎不冒然冲上来，还是继续躲避，他就前功尽弃了。
en_us: Jiang Yi had rawly bore the brunt of a single punch from that martial artist whose power level was in the third stage of the Cast Tripod Realm - if only to much quickly get closer to Jiang Ruhu and spit blood into his face at that precise moment. That one action was a big gamble for him. After all, that martial artist, whose power level was in the third stage of the Cast Tripod Realm, had three horsepower worth of strength. If he had not chosen to increase the speed of his single punch by a notch and neutralised some of the power in his fist in the process, Jiang Yi's spine bone would have been completely broken right now. Additionally, with Jiang Yi in mid-air, if Jiang Ruhu had not rashly rushed forward and instead chosen to continue avoiding any incoming attacks, Jiang Yi would have wasted all his efforts.

source: 江逸略微失望地睁开双眼，这无名口诀的确能修炼，也真能练出一缕元力，可惜提炼天地元气的速度比他现在修炼的江水决还要慢了不少……
en_us: Jiang Yi opened both his eyes with some disappointment. This nameless chant could indeed help him cultivate his essence force, and the method did indeed produce some results—it was just unfortunate that the speed at which he was cultivating heaven-and-earth essence force through this style was much too slow compared to the Jiang Water Art he practiced regularly.

source: 江逸百分百的确定，造成这封印变幻的原因绝对是黑色元力！这元力丹他以前吞服过很多，但从没有出现这样的异变。唯一的解释那就是——黑色元力能让封印的符文变少，能帮他破解封印。
en_us: Jiang Yi was a hundred percent confident that the reason for the change on the seal was most definitely the black essence force! In the past, he had consumed many essence force elixirs, yet such a mysterious change had never manifested before. The only possible explanation was that the black essence force could reduce the number of runic patterns in that seal, and in turn help him completely break that seal.

source: 江逸的丹田内不出意外的再次提炼出一缕黑色元力。
en_us: As expected, he managed to extract a wisp of black essence force from his dantian.

source: 江逸的丹田谁也不知道是好是坏！
en_us: Everyone knew the quality of Jiang Yi's dantian.

source: 江逸的双腿如一条毒蛇般附上江如虎身体，暴风雨般连续不断踢下，而且踢的地方全是江如虎的四肢，每一脚尽管没有运转黑色元力，但也力道十足，伴随着一阵骨头碎裂声，江如虎的两只手一条腿瞬间被踢断，痛得在地上翻滚惨嚎起来。
en_us: Both of Jiang Yi's legs attached themselves to Jiang Ruhu's body like a poisonous snake, and continuously kicked downwards like a torrential downpour. On top of that, the locations where he kicked into were all four of Jiang Ruhu's limbs. Even though he did not circulate any black essence force into each foot, each kick was nontheless done with ample strength. The kicks were swiftly followed by the sound of bones cracking, as two of Jiang Ruhu's hands and one of his legs were broken instantly. This left Jiang Ruhu rolling on the ground, as he started howled miserably due to his acute pain.

source: 江逸的右腿早早的甩了出去，如一条毒蛇般朝江松的顶来的小腿部扫去。
en_us: Jiang Yi's right leg had been released much earlier, flying towards and blocking Jiang Song's lower leg like a poisonous snake.

source: 江逸的头深深的低下，袖子内的拳头紧紧握住，条条青筋暴起，身子微微颤抖，一股戾气缓缓释放出来，就像是一只被激怒竖起鬃毛的狮子。
en_us: Jiang Yi bent down his head deeply; his fists in the sleeves were clenching so tightly that veins were popping up through skin. Jiang Yi's body shook with light tremors, slowly emitting an aura of hostility and viciousness. He was like an angered lion with bristling manes.

source: 江逸的左眼很快黑光一闪，他眼前的世界再次改变，江松本来速度还算不错的双掌，也变得缓慢起来。
en_us: Jiang Yi's left eye flashed bright black. The world before his eyes changed once again. Jiang Song's twin palms, normally moving at a pretty fast speed, also seemed to slow down somewhat.

source: 江逸的心神完全被手心的一片紫色金叶子吸引了，他这辈子可是从没见过紫金。他呼吸都变得急促起来，完全没有在意这小姐的话，随意摆手道：“行，以后有这样的丹药，一定卖给你们聚珍阁，在下还有事就先告辞了……”
en_us: Jiang Yi's attention was completely drawn to the piece of purple gold leaf in his palm. He had never seen purple gold before in his life. His breathing had even become hurried and brief. Without caring at all the words of the young mistress, he casually waved his hands and said, "Very well. The next time I have such elixir pills, I will definitely sell them to you at the Pearl Gathering Pavilion. I have other things to attend to, so I will take my leave now..."
